Repository: jcamilo1599/swift_math-game
Catalog: MathGame/Localizable.xcstrings
Source language: en
Languages: es, fr, pt_br

# home.subtitle
source: Train your mind every day.
es: Entrena tu mente todos los días.
fr: Entraînez votre esprit chaque jour.
pt_br: Treine sua mente todos os dias.

# nav.daily
source: Daily Challenge
es: Reto Diario
fr: Défi Quotidien
pt_br: Desafio Diário

# nav.classic
source: Classic modes
es: Modos clásicos
fr: Modes classiques
pt_br: Modos clássicos

# nav.more
source: More modes
es: Más modos
fr: Plus de modes
pt_br: Mais modos

# nav.profile
source: Profile
es: Perfil
fr: Profil
pt_br: Perfil

# nav.stats
source: Stats
es: Estadísticas
fr: Statistiques
pt_br: Estatísticas

# nav.achievements
source: Achievements
es: Logros
fr: Succès
pt_br: Conquistas

# nav.settings
source: Settings
es: Ajustes
fr: Réglages
pt_br: Ajustes

# mode.addition
source: Addition
es: Suma
pt_br: Adição

# mode.addition.subtitle
source: Add to win
es: Suma para ganar
fr: Additionnez pour gagner
pt_br: Some para vencer

# mode.subtraction
source: Subtraction
es: Resta
fr: Soustraction
pt_br: Subtração

# mode.subtraction.subtitle
source: Subtract fast
es: Resta rápido
fr: Soustrayez vite
pt_br: Subtraia rápido

# mode.multiplication
source: Multiplication
es: Multiplicación
pt_br: Multiplicação

# mode.multiplication.subtitle
source: Master the tables
es: Domina las tablas
fr: Maîtrisez les tables
pt_br: Domine as tabuadas

# mode.division
source: Division
es: División
pt_br: Divisão

# mode.division.subtitle
source: Divide and conquer
es: Divide y vencerás
fr: Divisez pour conquérir
pt_br: Divida e conquiste

# mode.power
source: Square
es: Cuadrado
fr: Carré
pt_br: Quadrado

# mode.power.subtitle
source: n squared
es: n al cuadrado
fr: n au carré
pt_br: n ao quadrado

# mode.root
source: Square Root
es: Raíz Cuadrada
fr: Racine carrée
pt_br: Raiz Quadrada

# mode.root.subtitle
source: Find the root
es: Encuentra la raíz
fr: Trouvez la racine
pt_br: Encontre a raiz

# mode.timeAttack
source: Time Attack
es: Contrarreloj
fr: Contre la montre
pt_br: Contra o tempo

# mode.timeAttack.subtitle
source: 60 seconds, max score
es: 60 segundos, máxima puntuación
fr: 60 secondes, score max
pt_br: 60 segundos, máxima pontuação

# mode.survival
source: Survival
es: Supervivencia
fr: Survie
pt_br: Sobrevivência

# mode.survival.subtitle
source: One life — go far
es: Una vida — llega lejos
fr: Une vie — allez loin
pt_br: Uma vida — vá longe

# mode.mixed
source: Mixed
es: Mezclado
fr: Mixte
pt_br: Misto

# mode.mixed.subtitle
source: All operations
es: Todas las operaciones
fr: Toutes les opérations
pt_br: Todas as operações

# mode.sequence
source: Sequence
es: Secuencia
fr: Séquence
pt_br: Sequência

# mode.sequence.subtitle
source: What comes next?
es: ¿Qué número sigue?
fr: Quel nombre suit ?
pt_br: Qual número vem?

# difficulty.easy
source: Easy
es: Fácil
fr: Facile
pt_br: Fácil

# difficulty.hard
source: Hard
es: Difícil
fr: Difficile
pt_br: Difícil

# difficulty.insane
source: Insane
es: Imposible
fr: Insensé
pt_br: Impossível

# ui.solve.this
source: Solve this
es: Resuelve
fr: Résolvez
pt_br: Resolva

# ui.tap.to.play
source: Tap to play
es: Toca para jugar
fr: Touchez pour jouer
pt_br: Toque para jogar

# ui.best.%lld
source: Best: %lld
es: Mejor: %lld
fr: Record : %lld
pt_br: Recorde: %lld

# ui.level.%lld
source: Level %lld
es: Nivel %lld
fr: Niveau %lld
pt_br: Nível %lld

# ui.daily.title
source: Today's Daily
es: Reto de Hoy
fr: Défi du Jour
pt_br: Desafio de Hoje

# ui.daily.subtitle.todo
source: 10 questions. Keep your streak alive.
es: 10 preguntas. No pierdas tu racha.
fr: 10 questions. Maintenez votre série.
pt_br: 10 perguntas. Mantenha sua sequência.

# ui.daily.subtitle.done
source: Daily complete. See you tomorrow.
es: Reto completado. Hasta mañana.
fr: Défi terminé. À demain.
pt_br: Desafio concluído. Até amanhã.

# ui.daily.cta
source: Play today
es: Jugar hoy
fr: Jouer aujourd'hui
pt_br: Jogar hoje

# ui.daily.next.%@
source: Next in %@
es: Próximo en %@
fr: Prochain dans %@
pt_br: Próximo em %@

source: GAME OVER
es: JUEGO TERMINADO
fr: FIN DE PARTIE
pt_br: FIM DE JOGO

# game.over.final_score
source: Final score
es: Puntaje final
fr: Score final
pt_br: Pontuação final

# game.over.correct.%lld
source: %lld correct answers
es: %lld respuestas correctas
fr: %lld bonnes réponses
pt_br: %lld respostas corretas

# game.over.try_again
source: Try again
es: Reintentar
fr: Réessayer
pt_br: Tentar novamente

# game.over.main_menu
source: Main menu
es: Menú principal
fr: Menu principal
pt_br: Menu principal

# daily.title
source: Daily Challenge
es: Reto Diario
fr: Défi Quotidien
pt_br: Desafio Diário

# daily.q.%1$lld.%2$lld
source: Question %1$lld of %2$lld
es: Pregunta %1$lld de %2$lld
fr: Question %1$lld sur %2$lld
pt_br: Pergunta %1$lld de %2$lld

# daily.result.complete
source: Daily Complete!
es: ¡Reto Completado!
fr: Défi Réussi !
pt_br: Desafio Concluído!

# daily.result.perfect
source: Perfect Daily!
es: ¡Reto Perfecto!
fr: Défi Parfait !
pt_br: Desafio Perfeito!

# daily.result.score
source: Your score
es: Tu puntaje
fr: Votre score
pt_br: Sua pontuação

# daily.result.streak.%lld
source: %lld-day streak
es: Racha de %lld días
fr: Série de %lld jours
pt_br: Sequência de %lld dias

# daily.result.done
source: Done
es: Listo
fr: Terminé
pt_br: Pronto

# daily.result.share
source: Share my result
es: Compartir resultado
fr: Partager mon résultat
pt_br: Compartilhar resultado

# daily.share.template.%1$lld.%2$@.%3$lld
source: I scored %1$lld %2$@ in today's Math Game daily — streak %3$lld 🔥
es: Hice %1$lld puntos %2$@ en el reto diario de Math Game — racha %3$lld 🔥
fr: J'ai marqué %1$lld %2$@ au défi quotidien Math Game — série %3$lld 🔥
pt_br: Fiz %1$lld pontos %2$@ no desafio diário do Math Game — sequência %3$lld 🔥

# daily.already_done.title
source: Today's daily is done!
es: ¡Reto de hoy completado!
fr: Défi du jour terminé !
pt_br: Desafio de hoje feito!

# daily.already_done.body.%lld
source: Your %lld-day streak is safe. Come back tomorrow for a new challenge.
es: Tu racha de %lld días está segura. Regresa mañana para un nuevo reto.
fr: Votre série de %lld jours est protégée. Revenez demain.
pt_br: Sua sequência de %lld dias está garantida. Volte amanhã.

# daily.already_done.back
source: Back to menu
es: Volver al menú
fr: Retour au menu
pt_br: Voltar ao menu

# profile.level.%lld
source: Level %lld
es: Nivel %lld
fr: Niveau %lld
pt_br: Nível %lld

# profile.coins.%lld
source: %lld coins
es: %lld monedas
fr: %lld pièces
pt_br: %lld moedas

# profile.daily_completed.%lld
source: %lld dailies done
es: %lld retos hechos
fr: %lld défis réussis
pt_br: %lld desafios feitos

# profile.stats
source: Your stats
es: Tus estadísticas
fr: Vos statistiques
pt_br: Suas estatísticas

# profile.current_streak
source: Current streak
es: Racha actual
fr: Série actuelle
pt_br: Sequência atual

# profile.longest_streak
source: Best streak
es: Mejor racha
fr: Meilleure série
pt_br: Melhor sequência

# profile.correct
source: Correct
es: Aciertos
fr: Réponses justes
pt_br: Acertos

# profile.unlocked
source: Unlocked
es: Desbloqueados
fr: Débloqués
pt_br: Desbloqueados

# profile.best_scores
source: Best scores
es: Mejores puntajes
fr: Meilleurs scores
pt_br: Melhores pontuações

# profile.recent_achievements
source: Recent achievements
es: Logros recientes
fr: Succès récents
pt_br: Conquistas recentes

# profile.no_scores
source: Play your first game to see scores here.
es: Juega tu primer juego para ver tus puntajes aquí.
fr: Jouez votre première partie pour voir vos scores.
pt_br: Jogue sua primeira partida para ver as pontuações.

# profile.no_achievements
source: No achievements unlocked yet.
es: Aún no desbloqueas logros.
fr: Aucun succès débloqué.
pt_br: Nenhuma conquista ainda.

# stats.heading
source: Stats
es: Estadísticas
fr: Statistiques
pt_br: Estatísticas

# stats.empty
source: Play a Daily to start tracking your progress.
es: Juega un reto diario para empezar a registrar tu progreso.
fr: Jouez un défi quotidien pour suivre vos progrès.
pt_br: Jogue um desafio diário para começar a registrar seu progresso.

# stats.daily.last14
source: Last 14 days
es: Últimos 14 días
fr: 14 derniers jours
pt_br: Últimos 14 dias

# stats.dailies
source: Daily totals
es: Totales diarios
fr: Totaux quotidiens
pt_br: Totais diários

# stats.perfect
source: Perfect dailies
es: Retos perfectos
fr: Défis parfaits
pt_br: Desafios perfeitos

# stats.three_star
source: 3-star dailies
es: Retos 3 estrellas
fr: Défis 3 étoiles
pt_br: Desafios 3 estrelas

# stats.two_star
source: 2-star dailies
es: Retos 2 estrellas
fr: Défis 2 étoiles
pt_br: Desafios 2 estrelas

# stats.one_star
source: 1-star dailies
es: Retos 1 estrella
fr: Défis 1 étoile
pt_br: Desafios 1 estrela

# onboarding.1.title
source: Sharpen your math
es: Afila tu matemática
fr: Aiguisez vos maths
pt_br: Afie sua matemática

# onboarding.1.body
source: Ten game modes from addition to sequences. Pick one and start.
es: Diez modos, desde sumas hasta secuencias. Elige uno y empieza.
fr: Dix modes, de l'addition aux suites. Choisissez et commencez.
pt_br: Dez modos, de adições a sequências. Escolha um e jogue.

# onboarding.2.title
source: One Daily Challenge
es: Un Reto Diario
fr: Un Défi par Jour
pt_br: Um Desafio Diário

# onboarding.2.body
source: Same questions for everyone. A new challenge every day at midnight.
es: Las mismas preguntas para todos. Un reto nuevo cada día a medianoche.
fr: Les mêmes questions pour tous. Un nouveau défi à minuit.
pt_br: As mesmas perguntas para todos. Novo desafio à meia-noite.

# onboarding.3.title
source: Build your streak
es: Construye tu racha
fr: Construisez votre série
pt_br: Construa sua sequência

# onboarding.3.body
source: Play every day to keep your streak alive. Skip a day, lose it all.
es: Juega cada día para mantener tu racha. Salta un día y la pierdes.
fr: Jouez chaque jour pour garder votre série. Un jour manqué, tout est perdu.
pt_br: Jogue todo dia para manter sua sequência. Pulou um dia, perdeu.

# onboarding.next
source: Next
es: Siguiente
fr: Suivant
pt_br: Próximo

# onboarding.start
source: Start playing
es: Empezar a jugar
fr: Commencer
pt_br: Começar a jogar

# settings.audio_haptics
source: Audio & haptics
es: Sonido y vibración
fr: Son & vibrations
pt_br: Som e vibração

# settings.sound
source: Sound effects
es: Efectos de sonido
fr: Effets sonores
pt_br: Efeitos sonoros

# settings.haptics
source: Haptics
es: Vibración
fr: Retour haptique
pt_br: Vibração

# settings.notifications
source: Notifications
es: Notificaciones
pt_br: Notificações

# settings.streak_reminder
source: Streak reminder
es: Recordatorio de racha
fr: Rappel de série
pt_br: Lembrete de sequência

# settings.about
source: About
es: Acerca de
fr: À propos
pt_br: Sobre

# settings.version
source: Version
es: Versión
pt_br: Versão

# settings.privacy
source: Privacy policy
es: Política de privacidad
fr: Politique de confidentialité
pt_br: Política de privacidade

# settings.support
source: Contact support
es: Contactar soporte
fr: Contacter le support
pt_br: Contatar suporte

# notification.streak.title
source: Don't lose your streak!
es: ¡No pierdas tu racha!
fr: Ne perdez pas votre série !
pt_br: Não perca sua sequência!

# notification.streak.body.%lld
source: Your %lld-day streak ends at midnight. Play today's Daily!
es: Tu racha de %lld días termina a medianoche. ¡Juega el reto de hoy!
fr: Votre série de %lld jours se termine à minuit. Jouez le défi du jour !
pt_br: Sua sequência de %lld dias acaba à meia-noite. Jogue o desafio de hoje!

# a11y.close
source: Close
es: Cerrar
fr: Fermer
pt_br: Fechar

# a11y.lives.%lld
source: %lld lives remaining
es: %lld vidas restantes
fr: %lld vies restantes
pt_br: %lld vidas restantes

# a11y.streak.%lld
source: %lld day streak
es: Racha de %lld días
fr: Série de %lld jours
pt_br: Sequência de %lld dias

# a11y.score.%lld
source: Score: %lld
es: Puntaje: %lld
pt_br: Pontuação: %lld

# a11y.timer.%lld
source: %lld seconds remaining
es: %lld segundos restantes
fr: %lld secondes restantes
pt_br: %lld segundos restantes

# a11y.stars.%lld
source: %lld stars earned
es: %lld estrellas ganadas
fr: %lld étoiles obtenues
pt_br: %lld estrelas ganhas

# a11y.xpbar.%1$lld.%2$lld.%3$lld
source: Level %1$lld, %2$lld of %3$lld experience points
es: Nivel %1$lld, %2$lld de %3$lld puntos de experiencia
fr: Niveau %1$lld, %2$lld sur %3$lld points d'expérience
pt_br: Nível %1$lld, %2$lld de %3$lld pontos de experiência

# a11y.answer.%lld
source: Answer %lld
es: Respuesta %lld
fr: Réponse %lld
pt_br: Resposta %lld

# ach.first_win.title
source: First victory
es: Primera victoria
fr: Première victoire
pt_br: Primeira vitória

# ach.first_win.desc
source: Finish your first run.
es: Termina tu primera partida.
fr: Finissez votre première partie.
pt_br: Termine sua primeira partida.

# ach.first_daily.title
source: First daily
es: Primer reto diario
fr: Premier défi
pt_br: Primeiro desafio

# ach.first_daily.desc
source: Complete one Daily Challenge.
es: Completa un Reto Diario.
fr: Terminez un défi quotidien.
pt_br: Complete um Desafio Diário.

# ach.perfect_daily.title
source: Flawless
es: Impecable
fr: Sans faute
pt_br: Impecável

# ach.perfect_daily.desc
source: Complete a Daily without errors.
es: Completa un reto sin errores.
fr: Terminez un défi sans erreur.
pt_br: Termine um desafio sem erros.

# ach.streak_3.title
source: Three in a row
es: Tres seguidos
fr: Trois d'affilée
pt_br: Três seguidos

# ach.streak_3.desc
source: Daily Challenge streak of 3 days.
es: Racha de 3 días en el Reto Diario.
fr: Série de 3 jours au défi.
pt_br: Sequência de 3 dias no desafio.

# ach.streak_7.title
source: One week strong
es: Una semana firme
fr: Une semaine entière
pt_br: Uma semana firme

# ach.streak_7.desc
source: Streak of 7 days.
es: Racha de 7 días.
fr: Série de 7 jours.
pt_br: Sequência de 7 dias.

# ach.streak_30.title
source: One month, every day
es: Un mes seguido
fr: Un mois sans rater
pt_br: Um mês inteiro

# ach.streak_30.desc
source: Streak of 30 days.
es: Racha de 30 días.
fr: Série de 30 jours.
pt_br: Sequência de 30 dias.

# ach.streak_100.title
source: Century
es: Centenario
fr: Centaine
pt_br: Centena

# ach.streak_100.desc
source: Streak of 100 days.
es: Racha de 100 días.
fr: Série de 100 jours.
pt_br: Sequência de 100 dias.

# ach.correct_100.title
source: Warming up
es: Calentando motores
fr: Échauffement
pt_br: Esquentando

# ach.correct_100.desc
source: 100 correct answers.
es: 100 respuestas correctas.
fr: 100 bonnes réponses.
pt_br: 100 respostas certas.

# ach.correct_1000.title
source: Calculator brain
es: Cerebro calculadora
fr: Cerveau calculatrice
pt_br: Cérebro calculadora

# ach.correct_1000.desc
source: 1,000 correct answers.
es: 1.000 respuestas correctas.
fr: 1 000 bonnes réponses.
pt_br: 1.000 respostas certas.

# ach.correct_10000.title
source: Living abacus
es: Ábaco viviente
fr: Boulier vivant
pt_br: Ábaco vivo

# ach.correct_10000.desc
source: 10,000 correct answers.
es: 10.000 respuestas correctas.
fr: 10 000 bonnes réponses.
pt_br: 10.000 respostas certas.

# ach.master_addition.title
source: Addition master
es: Maestro de la suma
fr: Maître de l'addition
pt_br: Mestre da soma

# ach.master_addition.desc
source: Best Addition score of 500.
es: 500 puntos en Suma.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Adição.

# ach.master_subtraction.title
source: Subtraction master
es: Maestro de la resta
fr: Maître de la soustraction
pt_br: Mestre da subtração

# ach.master_subtraction.desc
source: Best Subtraction score of 500.
es: 500 puntos en Resta.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Subtração.

# ach.master_multiplication.title
source: Multiplication master
es: Maestro de la multiplicación
fr: Maître de la multiplication
pt_br: Mestre da multiplicação

# ach.master_multiplication.desc
source: Best Multiplication score of 500.
es: 500 puntos en Multiplicación.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Multiplicação.

# ach.master_division.title
source: Division master
es: Maestro de la división
fr: Maître de la division
pt_br: Mestre da divisão

# ach.master_division.desc
source: Best Division score of 500.
es: 500 puntos en División.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Divisão.

# ach.master_power.title
source: Square master
es: Maestro del cuadrado
fr: Maître du carré
pt_br: Mestre do quadrado

# ach.master_power.desc
source: Best Square score of 500.
es: 500 puntos en Cuadrado.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Quadrado.

# ach.master_root.title
source: Root master
es: Maestro de la raíz
fr: Maître de la racine
pt_br: Mestre da raiz

# ach.master_root.desc
source: Best Square Root score of 500.
es: 500 puntos en Raíz Cuadrada.
fr: Meilleur score : 500.
pt_br: Recorde de 500 em Raiz Quadrada.

# ach.survival_50.title
source: Survivor
es: Sobreviviente
fr: Survivant
pt_br: Sobrevivente

# ach.survival_50.desc
source: 50 correct in Survival on a single run.
es: 50 aciertos en Supervivencia en una sola partida.
fr: 50 bonnes réponses en Survie en une partie.
pt_br: 50 acertos em Sobrevivência numa partida.

# ach.timeattack_30.title
source: Lightning brain
es: Cerebro relámpago
fr: Cerveau éclair
pt_br: Cérebro relâmpago

# ach.timeattack_30.desc
source: 30 correct in Time Attack on a single run.
es: 30 aciertos en Contrarreloj en una sola partida.
fr: 30 bonnes réponses au Contre la montre.
pt_br: 30 acertos em Contra o tempo numa partida.

# ach.level_10.title
source: Level 10
es: Nivel 10
fr: Niveau 10
pt_br: Nível 10

# ach.level_10.desc
source: Reach level 10.
es: Alcanza el nivel 10.
fr: Atteignez le niveau 10.
pt_br: Alcance o nível 10.

# ach.level_25.title
source: Level 25
es: Nivel 25
fr: Niveau 25
pt_br: Nível 25

# ach.level_25.desc
source: Reach level 25.
es: Alcanza el nivel 25.
fr: Atteignez le niveau 25.
pt_br: Alcance o nível 25.
